#encoding: utf-8
#language: ru

Функционал: Проверка прав доступа пользователя
	Как Разработчик
	Я хочу Проверить права доступа пользователя к объекту метаданных




Сценарий: Право доступа к объекту установлено
	Когда Я проверяю право доступа пользователя "Работник" на выполнение с объектом "Справочник" "Номенклатура" операции "Чтение"
	Тогда Право доступа установлено
	
Сценарий: Право доступа к объекту не установлено
	Когда Я проверяю отсутствие права доступа пользователя "Работник" на выполнение с объектом "Справочник" "Номенклатура" операции "Чтение"
	Тогда Права доступа на объект нет
	

