#encoding: utf-8
#language: ru

Функционал: Работа с заказами поставщику
	Как Разработчик
	Я хочу Проверить работу с заказами поставщику
	

Сценарий: Создание заказа поставщику
	Когда В панели разделов я выбираю "Закупки"
	И     В панели функций я выбираю "Заказы поставщикам"
	Тогда открылось окно "Заказы поставщикам"
	И     я нажимаю на кнопку "Новый"
	Тогда открылось окно "Заказ поставщику (создание)"
	И     я открываю выпадающий список "Поставщик"
	И     из выпадающего списка "Поставщик" я выбираю "Тестовый поставщик"
	И     я нажимаю кнопку выбора у поля "Организация"
	И     из выпадающего списка "Организация" я выбираю "Тестовая организация"
	И     я перехожу к закладке "Товары"
	И     я перехожу к закладке "Страницы"
	И     в таблице "Товары" я нажимаю на кнопку "Подобрать товары"
	Тогда открылось окно "Подбор товаров: Заказ поставщику (новый)"
	И     в таблице "ВидыНоменклатуры" я перехожу к строке:
	| 'Наименование'                      | 'Ссылка'                            |
	| 'Тестовый вид номенклатуры (товар)' | 'Тестовый вид номенклатуры (товар)' |
	И     в таблице "СписокСтандартныйПоискНоменклатура" я выбираю текущую строку
	И     я нажимаю на кнопку "Перенести в документ"
	Тогда открылось окно "Заказ поставщику (создание) *"
	И     в таблице "Товары" я перехожу к строке:
	| 'Отменено' | 'Статья расходов'                  | 'Склад'                  | 'N' | 'Номенклатура'   | 'Количество' | 'Подразделение-получатель' | 'Списать на расходы' | 'Упаковка' | 'Аналитика расходов'               | 'Ставка НДС' |
	| 'Нет'      | '<для работ/услуг без назначения>' | 'Тестовый оптовый склад' | '1' | 'Тестовый товар' | '1,000'      | '<для работ/услуг>'        | 'Нет'                | 'шт'       | '<для работ/услуг без назначения>' | '18%'        |
	И     в таблице "Товары" я активизирую поле "Цена"
	И     в таблице "Товары" я выбираю текущую строку
	И     в таблице "Товары" в поле "Цена" я ввожу текст "50,00"
	И     в таблице "Товары" я завершаю редактирование строки
	И     в таблице "Товары" я активизирую поле "Количество"
	И     в таблице "Товары" я выбираю текущую строку
	И     в таблице "Товары" в поле "Количество" я ввожу текст "10,000"
	И     в таблице "Товары" я завершаю редактирование строки
	И     я нажимаю на кнопку "Провести и закрыть"
	
	

Сценарий: Редактирование заказа поставщику
	Когда
	И
	Тогда
	
