#encoding: utf-8
#language: ru

@ExportScenarios

Функционал: Программное создание окружения
	Как Разработчик
	Я хочу создавать необходимое окружение для тестов
	Чтобы тесты имели необходимое окружение
	

Сценарий: Программное создание организации
	Когда Я программно создаю организацию "Тестовая организация"
	И я программно создаю учетную политику организации "Тестовая организация"
	

Сценарий: Программное создание подразделения
	Когда я программно создаю подразделение "Тестовое подразделение"
	

Сценарий: Программное создание оптового склада
	Когда я программно создаю оптовый склад "Тестовый оптовый склад" с системой учета "Простой"
	

Сценарий: Программное создание магазина
	Когда я программно создаю магазин "Тестовый магазин" с системой учета "Простая"	
	

Сценарий: Программное создание классификаторов номенклатуры
	Когда я программно созданию вид номенклатуры "Тестовый вид номенклатуры"
	

Сценарий: Программное создание номенклатуры
	Когда я программно создаю номенклатуру "Тестовая номенклатура" вида "Тестовый вид номенклатуры"
	

