#encoding: utf-8
#language: ru

Функционал: Удаление тестовых данных
	Как Разработчик
	Я хочу удалять все тестовые записи перед запуском сценариев тестирования
	Чтобы тестовая база была чистой
	
# Контекст:
#	Дано Я подключаю клиент тестирования с параметрами:
#	| 'Имя подключения' | 'Порт' | 'Строка соединения' | 'Логин'   				| 'Пароль' | 'Тип клиента' | 'Запускаемая обработка' |  'Дополнительные параметры строки запуска'  |
#	| 'ТестовыйСеанс'	| '1538' | ''                  | 'Администратор'		| ''       | ''            |                         |                                             |


Сценарий: Удаление всех документов
	Когда Я удаляю все документы видов, определенных в таблице:
	| 'РеализацияТоваровУслуг'	|
	| 'ЗаказНаСборку'			|


#Сценарий: Удаление записей регистров сведений
#	Когда
#	И
#	Тогда
	

Сценарий: Удаление всех не предопределенных элементов справочников
Когда Я удаляю все непредопределенные элементы справочников, определенных в таблице:
	| 'СтруктураПредприятия'			|
	| 'Склады'							|
	| 'Организации'						|
	| 'УчетныеПолитикиОрганизаций'		|
	| 'Номенклатура'					|
	
	
#И я закрываю TestClient "ТестовыйСеанс"