#encoding: utf-8
#language: ru

Функционал: Автоматическое заполнение артикула при создании номенклатуры
	Как Менеджер по выписке
	Я хочу Автоматически формировать артикул при создании нового элемента номенклатуры
	Контролировать уникальность артикула
	Чтобы Каждой создаваемой номенклатуре с незаполненным артикулом автоматически присваивался уникальный артикул
	
Контекст:
Дано Я подключаю клиент тестирования с параметрами:
	| 'Имя подключения' 		| 'Порт' | 'Строка соединения' | 'Логин'   			| 'Пароль' | 'Тип клиента' | 'Запускаемая обработка' |  'Дополнительные параметры строки запуска'  |
	| 'СеансМенеджерПоВыписке'	| '1538' | ''                  | 'МенеджерПоВыписке'| ''       | ''            |                         |                                             |
 
Сценарий: Создание новой номенклатуры с пустым артикулом
	Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Номенклатура"
	Тогда открылось окно "Номенклатура"
	И     в таблице "СписокСтандартныйПоискНоменклатура" я нажимаю на кнопку "Создать"
	Тогда открылось окно "Номенклатура (создание)"
	И     я открываю выпадающий список "Коллекция"
	И     из выпадающего списка "Коллекция" я выбираю "ISKRA"
	И     я открываю выпадающий список "Класс"
	И     из выпадающего списка "Класс" я выбираю "класс 1"
	И     в поле "Ширина, м" я ввожу текст "3,00"
	И     я открываю выпадающий список "Производитель"
	И     из выпадающего списка "Производитель" я выбираю "TARKETT"
	И     я нажимаю на кнопку "Записать"
	Тогда в логе сообщений TestClient есть строка "Поле \"Артикул \" не заполнено" 
	

#Сценарий: Создание новой номенклатуры с заполненным артикулом
#	Когда
#	И
#	Тогда
	

#Сценарий: Откат создания артикула номенклатуры в случае отказа записи
#	Когда
#	И
#	Тогда
	
 И я закрываю TestClient "СеансМенеджерПоВыписке"