#encoding: utf-8
#language: ru

@ExportScenarios

Функционал: Работа с организациями
	Как Разработчик
	Я хочу проверить работу с организациями
	

Сценарий: Создание организации
	Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Организации"
	Тогда открылось окно "Организации"
	И     я нажимаю на кнопку "Юридическое лицо"
	Тогда открылось окно "Организация (создание)"
	И	  В открытой форме в поле с именем "НаименованиеСокращенное" я ввожу текст "Тестовая организация"
	И     я перехожу к закладке "Учетная политика"
	И     я нажимаю на кнопку с именем "СоздатьНовуюУчетнуюПолитику"
	Тогда открылось окно "Учетная политика организации (создание)"
	И     в поле "Наименование" я ввожу текст "Общая"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Организация (создание) *"
	И     я нажимаю на кнопку "Записать и закрыть"
	И    Я закрыл все окна клиентского приложения

Сценарий: Редактирование организации
	Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Организации"
	И     в таблице "Список" я перехожу к строке:
	| 'Юрлицо / ИП'      | 'Наименование'         |
	| 'Юридическое лицо' | 'Тестовая организация' |
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "Тестовая организация (Организация)"
	И     в поле с именем "Префикс" я ввожу текст "ТТ"
	И     я нажимаю на кнопку "Записать и закрыть"

Сценарий: Создание банковского счета организации
	Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Организации"
	Тогда открылось окно "Организации"
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "Тестовая организация (Организация)"
	И     В текущем окне я нажимаю кнопку командного интерфейса "Банковские счета"
	И     в таблице "Список" я нажимаю на кнопку "Создать"
	Тогда открылось окно "Банковский счет организации (создание)"
	И     в поле "Номер счета" я ввожу текст "40702810100000000000"
	И     я перехожу к следующему реквизиту
	И     я нажимаю кнопку выбора у поля с именем "БИКБанка"
	Тогда открылось окно "Банки"
	И     в таблице "Список" я перехожу к строке:
	| 'Наименование' | 'БИК'       |
	| 'Г МОСКВА'     | '45       ' |
	И     в таблице "Список" я выбираю текущую строку
	И     в таблице "Список" я перехожу к строке:
	| 'Наименование'             | 'БИК'       |
	| '"НАЦИНВЕСТПРОМБАНК" (АО)' | '044525413' |
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "Банковский счет организации (создание) *"
	И     я открываю выпадающий список с именем "Наименование"
	И     из выпадающего списка с именем "Наименование" я выбираю "0000, Тестовая организация"
	И     я нажимаю на кнопку "Записать и закрыть"

Сценарий: Изменение банковского счета организации
	Когда открылось окно "Тестовая организация (Организация)"
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "* Тестовая организация (Банковский счет организации)"
	И     я изменяю флаг "Счет закрыт"
	И     я нажимаю на кнопку "Записать и закрыть"
	
