#encoding: utf-8
#language: ru

Функционал: Работа с договорами контрагентов
	Как Разработчик
	Я хочу Проверить работу с договорами контрагентов


Сценарий: Создание договора с покупателем
	Когда В панели разделов я выбираю "Продажи"
	И     В панели функций я выбираю "Клиенты"
	Тогда открылось окно "Контрагенты (Клиенты)"
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "Тестовый клиент (через помощника) ООО (Контрагент)"
	И     В текущем окне я нажимаю кнопку командного интерфейса "Договоры"
	И     в таблице "Список" я нажимаю на кнопку "Создать"
	Тогда открылось окно "Договор с покупателем / заказчиком (создание)"
	И     я открываю выпадающий список "Организация"
	И     я нажимаю кнопку выбора у поля "Организация"
	И     в поле "Номер" я ввожу текст "123"
	И     я перехожу к следующему реквизиту
	И     в поле "от" я ввожу текст "10.07.2017"
	И     я перехожу к следующему реквизиту
	И     в поле "Наименование" я ввожу текст "Договор поставки № 123 от 10.07.2017 г."
	И     я перехожу к следующему реквизиту
	И     я открываю выпадающий список "Наименование для печати"
	И     из выпадающего списка "Наименование для печати" я выбираю "Договор поставки № 123 от 10.07.2017 г."
	И     я нажимаю на кнопку "УстановитьИнтервал"
	Тогда открылось окно "Выберите период"
	И     я нажимаю на кнопку "Выбрать"
	Тогда открылось окно "Договор с покупателем / заказчиком (создание) *"
	И     в поле "Период с" я ввожу текст "10.07.2017"
	И     я перехожу к следующему реквизиту
	И     я перехожу к закладке "Расчеты"
	И     я перехожу к закладке "Группа страницы"
	И     я открываю выпадающий список "Детализация расчетов"
	И     я нажимаю кнопку выбора у поля "Детализация расчетов"
	И     из выпадающего списка "Детализация расчетов" я выбираю "По договорам"
	И     я изменяю флаг "при наличии просроченной задолженности"
	И     я перехожу к закладке "Учетная информация"
	И     я перехожу к закладке "Группа страницы"
	И     я нажимаю кнопку выбора у поля "Статья ДДС"
	Тогда открылось окно "Выбор статьи ДДС для операции \"Поступление оплаты от клиента\""
	И     в таблице "СписокПоХозяйственнойОперации" я выбираю текущую строку
	Тогда открылось окно "Договор с покупателем / заказчиком (создание) *"
	И     я открываю выпадающий список "Ставка НДС для платежей"
	И     я нажимаю кнопку выбора у поля "Ставка НДС для платежей"
	И     из выпадающего списка "Ставка НДС для платежей" я выбираю "18%"
	И     я нажимаю на кнопку "Записать и закрыть"

	

Сценарий: Изменение договора с покупателем
	Когда
	И
	Тогда
	

Сценарий: Создание договора с поставщиком
	Когда
	И
	Тогда
	

Сценарий: Изменение договора с поставщиком
	Когда
	И
	Тогда
	
