#encoding: utf-8
#language: ru

Функционал: Работа с контрагентами
	Как Разработчик
	Я хочу проверить работу с контрагентами
	

Сценарий: Создание клиента с помощью помощника
	Когда В панели разделов я выбираю "Продажи"
	И     В панели функций я выбираю "Клиенты"
	Тогда открылось окно "Контрагенты (Клиенты)"
	И     в таблице "Список" я нажимаю на кнопку "Создать"
	Тогда открылось окно "Помощник регистрации нового контрагента"
	И     в поле с именем "ИНН" я ввожу текст "4417887135"
	И     я перехожу к следующему реквизиту
	И     в поле с именем "КПП" я ввожу текст "265643783"
	И     в поле "Сокр.Юр. наименование" я ввожу текст "Тестовый клиент (через помощника) ООО"
	И     я перехожу к следующему реквизиту
	И     в поле "АдресЭППартнераТолькоПартнеры" я ввожу текст "test_client_pom@mail.ru"
	И     я нажимаю кнопку выбора у поля "Телефон "
	Тогда открылось окно "Телефон"
	И     в поле "Код страны" я ввожу текст "+7"
	И     я перехожу к следующему реквизиту
	И     в поле "Код города" я ввожу текст "917"
	И     я перехожу к следующему реквизиту
	И     в поле "Номер" я ввожу текст "8855444"
	И     я нажимаю на кнопку "ОК"
	Тогда открылось окно "Помощник регистрации нового контрагента"
	И     я изменяю флаг "Указать данные контактного лица (будет создано контактное лицо контрагента)"
	И     в поле с именем "ФамилияКЛ" я ввожу текст "Иванов"
	И     я перехожу к следующему реквизиту
	И     в поле с именем "ИмяКЛ" я ввожу текст "Иван"
	И     я перехожу к следующему реквизиту
	И     в поле с именем "ОтчествоКЛ" я ввожу текст "Иванович"
	И     я перехожу к следующему реквизиту
	И     я нажимаю кнопку выбора у поля с именем "ТелефонКЛ"
	Тогда открылось окно "Телефон"
	И     в поле "Номер" я ввожу текст "9955566"
	И     я нажимаю на кнопку "ОК"
	Тогда открылось окно "Помощник регистрации нового контрагента"
	И     в поле с именем "АдресЭПКЛ" я ввожу текст "ivanov.i@mail.ru"
	И     в поле "Моб. тел." я ввожу текст "+7 (917) 9955566"
	И     я нажимаю на кнопку с именем "Далее"
	И     я нажимаю кнопку выбора у поля "Фактический адрес контрагента"
	Тогда открылось окно "Фактический адрес"
	И     я нажимаю кнопку выбора у поля с именем "НаселенныйПункт"
	Тогда открылось окно "Населенный пункт"
	И     в поле "Город" я ввожу текст "Москва"
	И     я нажимаю на кнопку "ОК"
	Тогда открылось окно "Фактический адрес *"
	И     в поле с именем "Улица" я ввожу текст "Вернадского"
	И     я нажимаю кнопку выбора у поля "Дом"
	Тогда открылось окно "1С:Предприятие"
	И     я нажимаю на кнопку "OK"
	Тогда открылось окно "Фактический адрес *"
	И     в поле "Дом" я ввожу текст "32"
	И     я нажимаю на кнопку "ОК"
	Тогда открылось окно "Помощник регистрации нового контрагента"
	И     я нажимаю на кнопку "ЮридическийАдресРавенФактическому"
	И     я открываю выпадающий список с именем "ОсновнойМенеджер"
	И     я выбираю значение реквизита с именем "ОсновнойМенеджер" из формы списка
	Тогда открылось окно "Выбор пользователя"
	И     в таблице "ПользователиСписок" я перехожу к строке:
	| 'Полное имя'          |
	| 'Менеджер по выписке' |
	И     в таблице "ПользователиСписок" я выбираю текущую строку
	Тогда открылось окно "Помощник регистрации нового контрагента"
	И     я нажимаю на кнопку с именем "Далее3"
	И     я изменяю флаг "Указать данные банковского счета."
	И     в поле с именем "НомерСчета" я ввожу текст "40702800545444444444"
	И     в поле с именем "БИКБанка" я ввожу текст "040173733"
	И     я перехожу к следующему реквизиту
		И     я нажимаю на кнопку с именем "Далее3"
	Тогда открылось окно "Помощник регистрации нового контрагента *"
	И     я изменяю флаг "Открыть форму вновь созданного контрагента для указания дополнительной информации."
	И     я нажимаю на кнопку "Создать"
	И    Я закрыл все окна клиентского приложения

	Сценарий: Создание клиента
	
	Когда В панели разделов я выбираю "Продажи"
	И     В панели функций я выбираю "Клиенты"
	Тогда открылось окно "Контрагенты (Клиенты)"
	И     в таблице "Список" я нажимаю на кнопку "Создать нового"
	Тогда открылось окно "Контрагент (создание)"
	И     в поле "Сокр. юр. наименование" я ввожу текст "Тестовый клиент ООО"
	И     в поле с именем "ИНН" я ввожу текст "7884306227"
	И     в поле "КПП" я ввожу текст "078345720"
	И     я открываю выпадающий список "Основной менеджер"
	И     я выбираю значение реквизита "Основной менеджер" из формы списка
	Тогда открылось окно "Выбор пользователя"
	И     в таблице "ПользователиСписок" я перехожу к строке:
	| 'Полное имя'          |
	| 'Менеджер по выписке' |
	И     в таблице "ПользователиСписок" я выбираю текущую строку
	Тогда открылось окно "Контрагент (создание) *"
	И     я перехожу к закладке "Адреса, телефоны"
	И     я перехожу к закладке "Группа страницы"
	И     я нажимаю кнопку выбора у поля "Фактический адрес"
	Тогда открылось окно "Фактический адрес"
	И     в поле с именем "НаселенныйПункт" я ввожу текст "Москва"
	И     в поле с именем "Улица" я ввожу текст "Вернадского"
	И     в поле "Дом" я ввожу текст "33"
	И     я нажимаю на кнопку "ОК"
	Тогда открылось окно "Контрагент (создание) *"
	И     я нажимаю на кнопку с именем "КомандаКонтактнаяИнформацияПоле6b265e81x46bfx11e7x83d4x005056c000081"
	И     я выбираю пункт меню "Фактический адрес: Москва г, Вернадского, дом № 33"
	И     я нажимаю на кнопку "Записать и закрыть"
	И    Я закрыл все окна клиентского приложения

Сценарий: Редактирование клиента
	Когда
	И
	Тогда
	

Сценарий: Создание поставщика
	Когда
	И
	Тогда
	

Сценарий: Редактирование поставщика
	Когда
	И
	Тогда
	
