#encoding: utf-8
#language: ru

Функционал: Добавление и изменение организаций
	Как Ответственный по НСИ
	Я хочу создавать и изменять данные организаций
	Чтобы редактировать справочник организаций
	
Контекст:
	Дано Я подключаю клиент тестирования с параметрами:
	| 'Имя подключения' | 'Порт' | 'Строка соединения' | 'Логин'   				| 'Пароль' | 'Тип клиента' | 'Запускаемая обработка' |  'Дополнительные параметры строки запуска'  |
	| 'ТестовыйСеанс'	| '1538' | ''                  | 'ОтветственныйПоНСИ'	| ''       | ''            |                         |                                             |


Сценарий: Создание организации
	Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Организации"
	Тогда открылось окно "Организации"
	И     я нажимаю на кнопку "Юридическое лицо"
	Тогда открылось окно "Организация (создание)"
	И	  В открытой форме в поле с именем "НаименованиеСокращенное" я ввожу текст "Тестовая организация"
	И     я перехожу к закладке "Учетная политика"
	И     я нажимаю на кнопку с именем "СоздатьНовуюУчетнуюПолитику"
	Тогда открылось окно "Учетная политика организации (создание)"
	И     в поле "Наименование" я ввожу текст "Общая"
	И     я нажимаю на кнопку "Записать и закрыть"
	Тогда открылось окно "Организация (создание) *"
	И     я нажимаю на кнопку "Записать и закрыть"
	И    Я закрыл все окна клиентского приложения

	

Сценарий: Редактирование организации
Когда В панели разделов я выбираю "НСИ и администрирование"
И     В панели функций я выбираю "Организации"
И     в таблице "Список" я перехожу к строке:
	| 'Юрлицо / ИП'      | 'Наименование'         |
	| 'Юридическое лицо' | 'Тестовая организация' |
И     в таблице "Список" я выбираю текущую строку
Тогда открылось окно "Тестовая организация (Организация)"
И     в поле с именем "Префикс" я ввожу текст "ТТ"
И     я нажимаю на кнопку "Записать и закрыть"



И я закрываю TestClient "ТестовыйСеанс"
	
