#encoding: utf-8
#language: ru

@ExportScenarios

Функционал: Добавление и изменение подразделений
	Как Разработчик
	Я хочу проверить возможность создания и редактирования подразделений

Сценарий: Создание подразделения
	Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Структура предприятия"
	Тогда открылось окно "Структура предприятия"
	И     в таблице "Список" я разворачиваю текущую строку
	И     я нажимаю на кнопку "Создать"
	Тогда открылось окно "Подразделение (создание)"
	И     в поле "Наименование" я ввожу текст "Центральный офис предварительно"
	И     я нажимаю на кнопку "Записать и закрыть"
	

Сценарий: Редактирование подразделения
Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Структура предприятия"
	Тогда открылось окно "Структура предприятия"
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "Центральный офис предварительно (Подразделение)"
	И     в поле "Наименование" я ввожу текст "Центральный офис"
	И     я нажимаю на кнопку "Записать и закрыть"
