#encoding: utf-8
#language: ru

Функционал: Запуск 1С в режиме тонкого клиента
	Как Разработчик
	Я хочу проверить возможность запуска работником предприятия 1С в режиме тонкого клиента.
	Чтобы работник предприятия мог запустить 1С.
	
	
Сценарий: Запуск тонкого клиента
Когда Я подключаю клиент тестирования с параметрами:
	| 'Имя подключения' | 'Порт' | 'Строка соединения' | 'Логин'   | 'Пароль' | 'Тип клиента' | 'Запускаемая обработка' |  'Дополнительные параметры строки запуска'  |
	| 'Работник'        | '1538' | ''                  | 'Работник'| ''       | ''            |                         |                                             |
 И я закрываю TestClient "Работник"
   
	
