#encoding: utf-8
#language: ru

@ExportScenarios

Функционал: Проверка функционала Ответственного по НСИ
	Как Разработчик
	Я хочу Проверить доступность функционала пользователя Ответственный по НСИ
	Чтобы Ответственному по НСИ был доступен весь необходимый функционал
	
Сценарий: Подключение сеанса пользователя ОтветственныйПоНСИ
	Когда Я подключаю клиент тестирования с параметрами:
	| 'Имя подключения' | 'Порт' | 'Строка соединения' | 'Логин'   				| 'Пароль' | 'Тип клиента' | 'Запускаемая обработка' |  'Дополнительные параметры строки запуска'  	|
	| 'ТестовыйСеанс'	| '1538' | ''                  | 'ОтветственныйПоНСИ'	| ''       | ''            |                         |												|

Сценарий: Проверка работы с организациями и подразделениями
	Когда Создание организации
	И Редактирование организации
	И Создание подразделения
	И Редактирование подразделения 

Сценарий: Проверка работы с банковскими счетами организации
	Когда Создание банковского счета организации
	И Редактирование банковского счета организации

Сценарий: Проверка работы со складами и магазинами
	Когда Создание группы складов
	И Создание склада


# Сценарий: Работа с номенклатурой
# 	Когда
# 	И
# 	Тогда
	
