#encoding: utf-8
#language: ru

@ExportScenarios

Функционал: Проверка функционала пользователя
	Как Разработчик
	Я хочу Проверить доступность пользователю функционала
	Чтобы пользователю был доступен весь необходимый функционал

Сценарий: Проверка работы с организациями и подразделениями
	Когда Создание организации
	И Изменение организации
	И Создание подразделения
	И Изменение подразделения 

Сценарий: Проверка работы с банковскими счетами организации
	Когда Создание банковского счета организации
	И Изменение банковского счета организации

Сценарий: Проверка работы со складами и магазинами
	Когда Создание группы складов
	И Создание склада

Сценарий: Проверка работы с номенклатурой
	Когда Создание политики серий номенклатуры
	И  Изменение политики серий номенклатуры
	И Создание группы видов номенклатур
	И Изменение группы видов номенклатур
	И Создание вида номенклатуры типа товар
	

	
