#encoding: utf-8
#language: ru


Функционал: Проверка доступности функционала
	Как Разработчик
	Я хочу Проверить доступность пользователям функционала
	Чтобы Пользователям был доступен весь необходимый функционал
	

Сценарий: Удаление тестовых данных
	Когда Удаление всех документов
	И Удаление записей регистров сведений
	И Удаление всех не предопределенных элементов справочников

Сценарий: ПроверкаФункционалаОтветственногоПоНСИ

Когда Подключение сеанса пользователя ОтветственныйПоНСИ
И Проверка работы с организациями и подразделениями
И Проверка работы с банковскими счетами организации 
И Проверка работы со складами и магазинами
И Проверка работы с номенклатурой
	
