#encoding: utf-8
#language: ru

@ExportScenarios

Функционал: Создание и изменение политики серий номенклатуры
	Как Разработчик
	Я хочу Проверить доступность создания и изменения политик серий номенклатуры
	

Сценарий: Создание политики серий номенклатуры
	Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Классификаторы номенклатуры"
	Тогда открылось окно "Классификаторы номенклатуры"
	И     я нажимаю на кнопку "Политики учета серий"
	Тогда открылось окно "Политики учета серий"
	И     я нажимаю на кнопку "Создать"
	Тогда открылось окно "Политика учета серий (создание)"
	И     в поле "Наименование" я ввожу текст "Учет себестоимости серий"
	И     я перехожу к следующему реквизиту
	И     я открываю выпадающий список "Тип политики"
	И     я нажимаю кнопку выбора у поля "Тип политики"
	И     из выпадающего списка "Тип политики" я выбираю "Учет себестоимости по сериям"
	И     я перехожу к следующему реквизиту
	И     я нажимаю на кнопку "Записать и закрыть"
	

Сценарий: Изменение политики серий номенклатуры
		Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Классификаторы номенклатуры"
	Тогда открылось окно "Классификаторы номенклатуры"
	И     я нажимаю на кнопку "Политики учета серий"
	Тогда открылось окно "Политики учета серий"
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "Учет себестоимости серий (Политика учета серий)"
	И     в поле "Наименование" я ввожу текст "Учет себестоимости по сериям"
	И     я перехожу к следующему реквизиту
	И     я нажимаю на кнопку "Записать и закрыть"

	
