#encoding: utf-8
#language: ru

@ExportScenarios

Функционал: Создание и изменение вида номенклатуры
	Как Разрабочик
	Я хочу Проверить возможность создания вида номенклатуры

	Сценарий: Создание группы видов номенклатур
	Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Классификаторы номенклатуры"
	Тогда открылось окно "Классификаторы номенклатуры"
	И     я нажимаю на кнопку "Виды номенклатуры"
	Тогда открылось окно "Виды номенклатуры"
	И     я нажимаю на кнопку "Создать группу"
	Тогда открылось окно "Виды номенклатуры (создание группы)"
	И     в поле "Наименование" я ввожу текст "Товар"
	И     я нажимаю на кнопку "Записать"
	
	Сценарий: Изменение группы видов номенклатур
	И     в поле "Наименование" я ввожу текст "Товары"
	И     я нажимаю на кнопку "Записать и закрыть"
	

Сценарий: Создание вида номенклатуры типа товар
	Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Классификаторы номенклатуры"
	Тогда открылось окно "Классификаторы номенклатуры"
	И     я нажимаю на кнопку "Виды номенклатуры"
	Тогда открылось окно "Виды номенклатуры"
	И     я нажимаю на кнопку "Создать"
	Тогда открылось окно "Вид номенклатуры (создание)"
	И     в поле "Группа видов номенклатуры" я ввожу текст "Товары"
	И     из выпадающего списка "Группа видов номенклатуры" я выбираю "Товары"
	И     я перехожу к следующему реквизиту
	И     в поле "Наименование" я ввожу текст "Линолеум"
	И     я перехожу к следующему реквизиту
	И     я изменяю флаг "Серии:"
	И     я открываю выпадающий список "ВариантЗаданияНастроекСерий"
	И     я нажимаю кнопку выбора у поля "ВариантЗаданияНастроекСерий"
	И     из выпадающего списка "ВариантЗаданияНастроекСерий" я выбираю "Настроены для этого вида номенклатуры"
	И     я нажимаю на гиперссылку с именем "НадписьНастройкаИспользованияСерий"
	Тогда открылось окно "Настройка состава реквизитов серии"
	И     я открываю выпадающий список "Серия идентифицирует"
	И     я нажимаю кнопку выбора у поля "Серия идентифицирует"
	И     из выпадающего списка "Серия идентифицирует" я выбираю "Партия товаров"
	И     я нажимаю на кнопку "ОК"
	Тогда открылось окно "Вид номенклатуры (создание) *"
	И     я нажимаю кнопку выбора у поля "ПолитикаУчетаСерийНаСкладах"
	Тогда открылось окно "Политики учета серий"
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "Вид номенклатуры (создание) *"
	И     я перехожу к закладке "Настройки создания"
	И     я перехожу к закладке "Страницы"
	И     я перехожу к закладке "Рекомендации"
	И     в таблице "РеквизитыДляКонтроляНоменклатуры" я перехожу к строке:
	| 'Контроль заполнения' | 'Контроль уникальности' | 'Для размера ячейки' | 'Реквизит'      | 'Отображать при создании' |
	| 'Нет'                 | 'Нет'                   | 'Нет'                | 'Производитель' | 'Нет'                     |
	И     в таблице "РеквизитыДляКонтроляНоменклатуры" я активизирую поле "Для размера ячейки"
	И     в таблице "РеквизитыДляКонтроляНоменклатуры" я изменяю флаг "Отображать при создании"
	И     в таблице "РеквизитыДляКонтроляНоменклатуры" я завершаю редактирование строки
	И     в таблице "РеквизитыДляКонтроляНоменклатуры" я активизирую поле "Для размера ячейки"
	И     в таблице "РеквизитыДляКонтроляНоменклатуры" я изменяю флаг "Контроль заполнения"
	И     в таблице "РеквизитыДляКонтроляНоменклатуры" я завершаю редактирование строки
	И     я нажимаю на кнопку "Записать"

	

Сценарий: Создание вида номенклатуры вида услуга
	Когда
	И
	Тогда
	

Сценарий: Создание вида номенклатуры вида работа
	Когда
	И
	Тогда
	
