#encoding: utf-8
#language: ru

@ExportScenarios

Функционал: Создание и редактирование банковских счетов организации
	Как Разработчик
	Я хочу Проверить возможность создания и редактирования банковских счетов организации
	

Сценарий: Создание банковского счета организации
	Когда В панели разделов я выбираю "НСИ и администрирование"
	И     В панели функций я выбираю "Организации"
	Тогда открылось окно "Организации"
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "Тестовая организация (Организация)"
	И     В текущем окне я нажимаю кнопку командного интерфейса "Банковские счета"
	И     в таблице "Список" я нажимаю на кнопку "Создать"
	Тогда открылось окно "Банковский счет организации (создание)"
	И     в поле "Номер счета" я ввожу текст "40702810100000000000"
	И     я перехожу к следующему реквизиту
	И     я нажимаю кнопку выбора у поля с именем "БИКБанка"
	Тогда открылось окно "Банки"
	И     в таблице "Список" я перехожу к строке:
	| 'Наименование' | 'БИК'       |
	| 'Г МОСКВА'     | '45       ' |
	И     в таблице "Список" я выбираю текущую строку
	И     в таблице "Список" я перехожу к строке:
	| 'Наименование'             | 'БИК'       |
	| '"НАЦИНВЕСТПРОМБАНК" (АО)' | '044525413' |
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "Банковский счет организации (создание) *"
	И     я открываю выпадающий список с именем "Наименование"
	И     из выпадающего списка с именем "Наименование" я выбираю "0000, Тестовая организация"
	И     я нажимаю на кнопку "Записать и закрыть"

	

Сценарий: Редактирование банковского счета организации
	Когда открылось окно "Тестовая организация (Организация)"
	И     в таблице "Список" я выбираю текущую строку
	Тогда открылось окно "* Тестовая организация (Банковский счет организации)"
	И     я изменяю флаг "Счет закрыт"
	И     я нажимаю на кнопку "Записать и закрыть"

	
