
#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"_()","_","Когда","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯУдалилВсеДокументы()","ЯУдалилВсеДокументы","Тогда Я удалил все документы","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯУдаляюВсеДокументыВидовОпределенныхВТаблице(ТабПарам)","ЯУдаляюВсеДокументыВидовОпределенныхВТаблице","Когда Я удаляю все документы видов, определенных в таблице:","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯУдаляюВсеНепредопределенныеЭлементыСправочниковОпределенныхВТаблице(ТабПарам)","ЯУдаляюВсеНепредопределенныеЭлементыСправочниковОпределенныхВТаблице","Когда Я удаляю все непредопределенные элементы справочников, определенных в таблице:","","");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Когда Я удаляю все документы видов, определенных в таблице:
//@ЯУдаляюВсеДокументыВидовОпределенныхВТаблице(ТабПарам)
Процедура ЯУдаляюВсеДокументыВидовОпределенныхВТаблице(ТабПарам) Экспорт
	
Для каждого Строка Из ТабПарам Цикл

УдалитьВсеДокументыВида(Строка.Кол1);	

КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезконтекста
Процедура УдалитьВсеНеПредопределенныеЭлементыСправочникаВида(ИмяСпр)
	
	Если Метаданные.Справочники[ИмяСпр].Иерархический и Метаданные.Справочники[ИмяСпр].ВидИерархии = 
		Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Справочник1.Ссылка
		|ИЗ
		|	Справочник.Справочник1 КАК Справочник1
		|ГДЕ
		|	ИСТИНА
		|	И НЕ Справочник1.Предопределенный
		|	И НЕ Справочник1.ЭтоГруппа";
		
		
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Справочник1",ИмяСпр);	
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектСпр = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектСпр.Удалить();
		КонецЦикла;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Справочник1.Ссылка
		|ИЗ
		|	Справочник.Справочник1 КАК Справочник1
		|ГДЕ
		|	ИСТИНА
		|	И НЕ Справочник1.Предопределенный
		|	И Справочник1.ЭтоГруппа";
		
		
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Справочник1",ИмяСпр);	
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектСпр = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектСпр.Удалить();
		КонецЦикла;
	Иначе
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Справочник1.Ссылка
		|ИЗ
		|	Справочник.Справочник1 КАК Справочник1
		|ГДЕ
		|	НЕ Справочник1.Предопределенный";
		
		
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Справочник1",ИмяСпр);	
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектСпр = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектСпр.Удалить();
		КонецЦикла;
	КонецЕсли;	 
	
КонецПроцедуры

&НаСервереБезконтекста
Процедура УдалитьВсеДокументыВида(ИмяДок)
	
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Документ1.Ссылка
		|ИЗ
		|	Документ.Документ1 КАК Документ1";
		
		
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ1",ИмяДок);	
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОбъектДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Попытка
		
		ОбъектДок.УстановитьПометкуУдаления(Истина);
		ОбъектДок.Удалить();
	    		
		Исключение
			
		Инфо = ИнформацияОбОшибке();
		ВызватьИсключение Инфо.Описание;
		
		КонецПопытки;	
						
		КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
//Когда Я удаляю все непредопределенные элементы справочников, определенных в таблице:
//@ЯУдаляюВсеНепредопределенныеЭлементыСправочниковОпределенныхВТаблице(ТабПарам)
Процедура ЯУдаляюВсеНепредопределенныеЭлементыСправочниковОпределенныхВТаблице(ТабПарам) Экспорт
	
Для каждого Строка Из ТабПарам Цикл

УдалитьВсеНеПредопределенныеЭлементыСправочникаВида(Строка.Кол1);	

КонецЦикла;	
	
КонецПроцедуры
