
&НаСервере
Процедура ЗаполнитьНаСервере()

Для каждого СправочникМетаданные Из Метаданные.Справочники Цикл

НоваяСтрока = Объект.Справочники.Добавить();	

НоваяСтрока.ИмяОбъекта = "#| '"+ СправочникМетаданные.Имя + "' |";

КонецЦикла;	

Для каждого ДокументМетаданные Из Метаданные.Документы Цикл

НоваяСтрока = Объект.Документы.Добавить();	

НоваяСтрока.ИмяОбъекта = "#| '"+ ДокументМетаданные.Имя + "' |";

КонецЦикла;	

Для каждого РСМетаданные Из Метаданные.РегистрыСведений Цикл

НоваяСтрока = Объект.РегистрыСведений.Добавить();	

НоваяСтрока.ИмяОбъекта = "#| '"+ РСМетаданные.Имя + "' |";

КонецЦикла;	

Для каждого РНМетаданные Из Метаданные.РегистрыНакопления Цикл

НоваяСтрока = Объект.РегистрыНакопления.Добавить();	

НоваяСтрока.ИмяОбъекта = "#| '"+ РНМетаданные.Имя + "' |";

КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда) 
	
Объект.Документы.Очистить();
Объект.Справочники.Очистить();
Объект.РегистрыСведений.Очистить();
Объект.РегистрыНакопления.Очистить();

ЗаполнитьНаСервере();
	
КонецПроцедуры
